zhjiehua/PMSM/STM32 PMSM FOC LIB/Common/Libraries/STM32_EVAL/STM32F4XX_DUAL/STM32F4xx_dual_lcd.c
  /* Configure LCD_SPI MISO pin */
  GPIO_InitStructure.GPIO_Pin = LCD_SPI_MISO_PIN;
  GPIO_Init(LCD_SPI_MISO_GPIO_PORT, &GPIO_InitStructure);
    
  /* Configure LCD_SPI MOSI pin */
  GPIO_InitStructure.GPIO_Pin = LCD_SPI_MOSI_PIN;
  GPIO_Init(LCD_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* Connect PE.13 to SPI SCK */
  GPIO_PinAFConfig(LCD_SPI_SCK_GPIO_PORT, LCD_SPI_SCK_SOURCE, LCD_SPI_SCK_AF);

  /* Connect PE.14 to SPI MISO */
  GPIO_PinAFConfig(LCD_SPI_MISO_GPIO_PORT, LCD_SPI_MISO_SOURCE, LCD_SPI_MISO_AF);

  /* Connect PE.15 to SPI MOSI */
  GPIO_PinAFConfig(LCD_SPI_MOSI_GPIO_PORT, LCD_SPI_MOSI_SOURCE, LCD_SPI_MOSI_AF);

  SPI_I2S_DeInit(LCD_SPI);
  
  /* SPI Config */
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;

  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(LCD_SPI, &SPI_InitStructure);
  
  /* Configure the RX FIFO Threshold to Quarter Full */
  //SPI_RxFIFOThresholdConfig(LCD_SPI, SPI_RxFIFOThreshold_QF);
  
  /* SPI enable */
  SPI_Cmd(LCD_SPI, ENABLE);
}

/**
  * @brief  Displays a pixel.
  * @param  x: pixel x.
  * @param  y: pixel y.  
  * @retval None
  */
static void PutPixel(int16_t x, int16_t y)
{ 
  if(x < 0 || x > 239 || y < 0 || y > 319)
  {
    return;  
  }
  LCD_DrawLine(x, y, 1, LCD_DIR_HORIZONTAL);
}

#ifndef USE_Delay
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0; 
  for(index = (34000 * nCount * 10); index != 0; index--)
  {
  }
}
#endif /* USE_Delay*/

/**
* @brief  Inserts a delay time.
* @param  nCount: specifies the delay time length.
* @retval None
*/
static void small_delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0;
  for(index = (10 * nCount); index != 0; index--)
  {
  }
}

/**
  * @brief  Plot BMP.
  * @param  uint16_t pBufferImage pointer to the BMP buffer;
  * @param  uint16_t Xpos orizontal position of the top left point of the BMP 
  * @param  uint16_t Ypos vertical position of the top left point of the BMP
  * @param  uint16_t Width width of BMP expressed in pixel
  * @param  uint16_t Height heigth of BMP expressed in pixel
  * @retval None
  */
void LCD_PlotBMP(uint16_t *pBufferImage, uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
// Not implemented
  
//  uint32_t index = 0, i = 0;
//  uint16_t Xaddress = Ypos + Height;
//  uint16_t Yaddress = LCD_PIXEL_WIDTH - 1 - Xpos;
//  
//  
//  LCD_SetCursor(Xaddress, Yaddress);
//  
//  for(index = 0; index < Height; index++)
//  {
//    /* Set GRAM write direction and BGR = 1 */
//    /* I/D=00 (Horizontal : decrement, Vertical : decrement) */
//    /* AM=1 (address is updated in vertical writing direction) */
//    LCD_WriteReg(LCD_REG_3, 0x1008);
//    
//    LCD_WriteRAM_Prepare();
//    
//    for(i = 0; i < Width; i++)
//    {
//      LCD_WriteRAM(pBufferImage[i + index * Width]);
//    }
//    Xaddress--;
//    LCD_SetCursor(Xaddress, Yaddress);
//  }
//  
//  /* Set GRAM write direction and BGR = 1 */
//  /* I/D = 01 (Horizontal : increment, Vertical : decrement) */
//  /* AM = 1 (address is updated in vertical writing direction) */
//  LCD_WriteReg(LCD_REG_3, 0x1018);
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawCharHorizontal(uint8_t Xpos, uint16_t Ypos, const uint16_t *c)
{
//  LCD_DrawChar(Xpos,Ypos,c);
//  uint8_t index = 0, i = 0;
//  uint8_t Xaddress = 0;
//  uint16_t LocTextColor = 0, LocBackColor = 0; 
//
//  LCD_GetColors(&LocTextColor, &LocBackColor);
//    
//  Xaddress = Xpos;
//  
//  LCD_SetCursor(Xaddress, Ypos);
//  
//  for(index = 0; index < LCD_GetFont()->Height; index++)
//  {        
//    for(i = 0; i <  LCD_GetFont()->Width; i++)
//    {
//      if(!(c[i] & (0x1 << index)))
//      {
//        LCD_WriteRAM(LocBackColor);
//      }
//      else
//      {
//        LCD_WriteRAM(LocTextColor);
//      }
//    }
//            
//    Xaddress++;
//    LCD_SetCursor(Xaddress, Ypos);
//  }
}

LCD_x_axes_t LCD_GetXAxesDirection(void)
{
  LCD_x_axes_t retVal;
  if(LCDType == LCD_HX8347D)
  {
    retVal = LCD_X_AXES_NOT_INVERTED;
  }
  else
  {
    retVal = LCD_X_AXES_INVERTED;
  }
  return retVal;
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
